function home() {

    document.getElementById('contentContainer').innerHTML = `
        <h2 id="namespace">Начало</h2>

        <p id="paragraph">
            Периферните устройства осигуряват взаимодействието с компютъра. В зависимост от функциите си периферните устройства са входни и изходни, запомнящи и комуникационни.

            <br><br>

            Чрез входните периферни устройства, централния процесор получава информация (под формата на данни, програми, указания и др.). Типични входни устройства са клавиатурата и мишката. Използват се още устройства като джойстик и трекбол (за посочване), скенер (за въвеждане на графични изображения), микрофон (за гласов вход) и др.

            <br><br>

            Изходни периферни устройства са различни дисплеи (телевизионни и др. екрани), печатащи устройства, плотери (за чертане), тонколони (за възпроизвеждане на звук и музика).

            <br><br>

            Запомнящите периферни устройства функционират едновременно като входни и изходни, и за своята работа изискват специфичен носител за запомняне на данни. Запомнящите устройства се различават помежду си по използваната технология за съхраняване на данните магнитни, оптически и магнитно-оптически; по възможността за замяна на носителя със сменяем и с несменяем носител.

            <br><br>

            Чрез комуникационните периферни устройства един компютър обменя данни с други компютри. Типичен представител на комуникационните устройства е модемът, чрез който един компютър може да преобразува дискретна информация в аналогова и обратно и по този начин да използва традиционната аналогова телефонна мрежа. Други устройства от този вид са съоръженията, чрез които се използва самостоятелна кабелна система, свързваща компютри в мрежа.


        </p>
    `
}

function input() {
    document.getElementById('contentContainer').innerHTML = `
        <h2 id="namespace">Входни устройства</h2>

        <p id="paragraph">
            При повечето компютри клавиатурата е основното входно устройство за текст. Клавиатурата е разделена на шест части: Символен блок, Специални клавиши, Функционални клавиши, Навигационен блок, Цифров блок, и Windows клавиши. Клавишите с букви се използват по същия начин, както тези при пишещата машина. Ако натиснете клавиш с буква и го задържите, то тя ще се повтори докато не го отпуснете. Клавишите с цифри се намират в горната част на символния блок. За да въведете знак, който е изписан над цифрите, натиснете и задръжте клавиша Shift при натискане на знака. Символните клавиши се използват и за въвеждане на пунктуационни и математически знаци.

            <br><br>
            
            
            
            Щракнете върху всеки един от цветните клавиши, за да разберете неговото предназначение:
            
            <br><br>

            Цифровият блок се намира в дясната част на клавиатурата и с него могат да се изпълняват две различни функции. Когато е включена светлинната индикация Numlock, цифровият блок се използва за въвеждане на цифри и операции (като + и -). Когато е изключена светлинната индикация на Numlock, цифровият блок се използва за навигация (клавишите стрелки, Home, End, PgUp и PgDn).
            
            <br><br>

            Windows клавиши има само на по-новите модели клавиатури. Те са удобни при извършване на някои операции в Windows.
            
            <br><br>

            Мишката е входящо устройство, което се държи в ръка.
            
            <br><br>
            
            Обикновено тя е свързана с компютъра посредством кабел. Когато движите мишката върху подложката или щраквате с бутон, тези движения и действия се отразяват на екрана с помощта на така наречения показалец. Основните действие, които се извършват с мишката са, свободно движение, еднократно щракване, влачене и пускане и двукратно щракване.
            
            <br><br>

            Мишката има алтернативни устройства. Обикновено при лаптопите се използва тракбол или тачпад. Първото представлява билюр, разположен в предната част на клавиатурата, а второто правоъгълна плоскост, върху която се допира пръст на ръката, за да се управлява курсора.
            
            <br><br>

            Джойстикът е устройство, което обикновено се използва в компютърните игри. Той представлява основна, върху която е поставена дръжка с бутони. Потребителят може да накланя дръжката в различни посоки и по този начин да предизвиква събития на екрана.
            
            <br><br>

            Светлинната писалка е друго входно устройство, приличащо на химикал. Тя е свързана с монитора и чрез посочване на определени участъци от него може да се изпълняват различни команди от програми.
        </p>
    `
}

function output() {
    document.getElementById('contentContainer').innerHTML = `
        <h2 id="namespace">Изходни устройства</h2>

        <p id="paragraph">
            Основното изходно устройство е монитора. Това е устройството, в което гледате сега. Мониторите притежават две важни характеристики:
            
            <br><br>

            -Големина на екрана <br>
            -Честота на опресняване

            <br><br>

            Първата показва размера на екрана и се измерва в инчове по неговия диагонал. Стандартните големини са 15”, 17”, 19”, 21”.

            <br><br>
            
            Втората показва през какъв интервал от време се изчертава изображение на екрана. Тя се измерва в MHz и колкото числото е по-голямо, толкова напрежението за очите е по-малко. Стандартната честота на опресняване, при която не се забелязват трептенията на екрана е 75 MHz.

            <br><br>
            
            Принтерите Ви позволяват да отпечатате на хартия създадените и обработени картинки и текст в компютъра. Съществуват три различни вида принтери по отношение на технологията, която използват:
            
            <br><br>

            -Матрични <br>
            -Мастиленоструйни <br>
            -Лазерни <br>
            
            <br><br>
            
            Други изходни устройства са колонките и слушалките. Чрез тях се чува звука, който компютъра може да възпроизвежда.

            <br><br>
            
            С помощта на плотера може да се отпечатват големи чертежи и схеми. Той притежава молив, с които рисува върху листа.

        </p>
    `
}